#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-aws-sftp/runs/run-9vsDfq7dm6viArfY

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.sftp.random_id.aws_s3_bucket_transfer_server: Refreshing state... [id=yZ3wn3AZsBw]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01b5e8fa2ed65a1e5]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bc63e348ba1dc4291080289494]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01efe5ea615845a7c]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bc63e348ba1dc429]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e8c9d3bfec4567501080289494]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e8c9d3bfec456750]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e370c3e394c1edbc]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0332e0f9fd0ecf178]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c1a6f35b4cd9e791]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07708c2ad5cc02ee0]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06070bdc58cc8225f]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cf4f40431f5540fd]
module.sftp.aws_s3_bucket.transfer_server_bucket: Refreshing state... [id=lab-transfer-server-s3-bucket-c99df09f7019b01c]
module.sftp.aws_iam_role.transfer_server_role: Refreshing state... [id=lab-transfer-server-transfer_server_role]
module.sftp.aws_iam_role.transfer_server_write_role: Refreshing state... [id=lab-transfer-server-write-role]
module.sftp.aws_iam_role.transfer_server_readonly_role: Refreshing state... [id=lab-transfer-server-readonly-role]
module.sftp.aws_iam_role_policy.transfer_server_to_cloudwatch_policy: Refreshing state... [id=lab-transfer-server-transfer_server_role:lab-transfer-server-transfer_server_to_cloudwatch_policy]
module.sftp.aws_transfer_server.transfer_server_private[0]: Refreshing state... [id=s-35e96e08633246ea9]
module.sftp.aws_transfer_user.transfer_server_write_user_private[0]: Refreshing state... [id=s-35e96e08633246ea9/example01-user]
module.sftp.aws_iam_role_policy.transfer_server_readonly_policy: Refreshing state... [id=lab-transfer-server-readonly-role:lab-transfer-server-transfer_server_readonly_policy]
module.sftp.aws_iam_role_policy.transfer_server_write_policy: Refreshing state... [id=lab-transfer-server-write-role:lab-transfer-server-transfer_server_write_policy]
module.sftp.aws_transfer_ssh_key.transfer_server_write_ssh_keys_private[0]: Refreshing state... [id=s-35e96e08633246ea9/example01-user/key-0c42161311fa4cf69]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.sftp.aws_transfer_server.transfer_server_private[0] has been changed
  ~ resource "aws_transfer_server" "transfer_server_private" {
        id                     = "s-35e96e08633246ea9"
        tags                   = {
            "type" = "Managed by Terraform"
        }
        # (11 unchanged attributes hidden)

      ~ endpoint_details {
          + address_allocation_ids = []
            # (4 unchanged attributes hidden)
        }
    }
  # module.sftp.aws_transfer_user.transfer_server_write_user_private[0] has been changed
  ~ resource "aws_transfer_user" "transfer_server_write_user_private" {
        id                  = "s-35e96e08633246ea9/example01-user"
      + tags                = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vpc.module.vpc.aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0bc63e348ba1dc429"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.249.0.0/16"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = "pcx-0951610e2a540f8ec"
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.25.0.0/16"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = "pcx-0951610e2a540f8ec"
            },
            # (1 unchanged element hidden)
        ]
        tags             = {
            "Environment" = "sftp-vpc"
            "Name"        = "sftp-vpc-private-ap-southeast-1a"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.sftp.aws_transfer_server.transfer_server[0] will be created
  + resource "aws_transfer_server" "transfer_server" {
      + arn                    = (known after apply)
      + domain                 = "S3"
      + endpoint               = (known after apply)
      + endpoint_type          = "PUBLIC"
      + force_destroy          = false
      + host_key_fingerprint   = (known after apply)
      + id                     = (known after apply)
      + identity_provider_type = "SERVICE_MANAGED"
      + logging_role           = "arn:aws:iam::295611461399:role/lab-transfer-server-transfer_server_role"
      + protocols              = [
          + "SFTP",
        ]
      + security_policy_name   = "TransferSecurityPolicy-2018-11"
      + tags                   = {
          + "type" = "Managed by Terraform"
        }
      + tags_all               = {
          + "type" = "Managed by Terraform"
        }
    }

  # module.sftp.aws_transfer_server.transfer_server_private[0] will be destroyed
  - resource "aws_transfer_server" "transfer_server_private" {
      - arn                    = "arn:aws:transfer:ap-southeast-1:295611461399:server/s-35e96e08633246ea9" -> null
      - domain                 = "S3" -> null
      - endpoint               = "s-35e96e08633246ea9.server.transfer.ap-southeast-1.amazonaws.com" -> null
      - endpoint_type          = "VPC" -> null
      - force_destroy          = false -> null
      - host_key_fingerprint   = "SHA256:vuC60eM6UM2OMvFzT8EjjSD37SJXkxiSNZOiie512c0=" -> null
      - id                     = "s-35e96e08633246ea9" -> null
      - identity_provider_type = "SERVICE_MANAGED" -> null
      - logging_role           = "arn:aws:iam::295611461399:role/lab-transfer-server-transfer_server_role" -> null
      - protocols              = [
          - "SFTP",
        ] -> null
      - security_policy_name   = "TransferSecurityPolicy-2018-11" -> null
      - tags                   = {
          - "type" = "Managed by Terraform"
        } -> null
      - tags_all               = {
          - "type" = "Managed by Terraform"
        } -> null

      - endpoint_details {
          - address_allocation_ids = [] -> null
          - security_group_ids     = [
              - "sg-0e7bf82d94ee2d485",
            ] -> null
          - subnet_ids             = [
              - "subnet-06070bdc58cc8225f",
            ] -> null
          - vpc_endpoint_id        = "vpce-0b65d83f1eea510d7" -> null
          - vpc_id                 = "vpc-0c1a6f35b4cd9e791" -> null
        }
    }

  # module.sftp.aws_transfer_ssh_key.transfer_server_write_ssh_keys_private[0] will be destroyed
  - resource "aws_transfer_ssh_key" "transfer_server_write_ssh_keys_private" {
      - body      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDOt6TLtVqAZ2cb07xmmatfDbThVu3lEP8i0wnhZ0/t11YRARvoLQf31LaxI20M6oSRJNLpuSyl2jDJ35/BpltdAsSC7eGumxSev23dr5l3MSKNEnZzrAbBPtKpQKALqsXuG9d6Xf9N4pMTn0LjswCKcnHAiO+DoqoX8NS2sT7znOzA6/IxXiYUsNsOiI2pyM9Z6z+m+ukOvZyjuF5bdLMjyTwCtlCOZ1XpD4c+bu/uJsWECKp14hn23QJtGo/KebpY4oUn/qYo1WC+0wVp2AQsDeNcojiTsU9fBADM0SzVp5OR0r2tbBgxXrB2adApj+YpBtaOTDt3E2j32otsYGTF0snf974eLsumZ5TI3aaVKH1NgqhTjRyifmI4h65/h3qVlggNV3ywAzSHtn79FEEXaJDiOFLRSsMTpaUkM5CjiJR5/PxkJ7LxPMECzET+juSosWfrc2Ttivke9HhIi6FJBnNIOnuvUHU/EEWA55vnqlVnZMoCVPPJd0BvbTACXtM=" -> null
      - id        = "s-35e96e08633246ea9/example01-user/key-0c42161311fa4cf69" -> null
      - server_id = "s-35e96e08633246ea9" -> null
      - user_name = "example01-user" -> null
    }

  # module.sftp.aws_transfer_ssh_key.transfer_server_write_ssh_keys_public[0] will be created
  + resource "aws_transfer_ssh_key" "transfer_server_write_ssh_keys_public" {
      + body      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDOt6TLtVqAZ2cb07xmmatfDbThVu3lEP8i0wnhZ0/t11YRARvoLQf31LaxI20M6oSRJNLpuSyl2jDJ35/BpltdAsSC7eGumxSev23dr5l3MSKNEnZzrAbBPtKpQKALqsXuG9d6Xf9N4pMTn0LjswCKcnHAiO+DoqoX8NS2sT7znOzA6/IxXiYUsNsOiI2pyM9Z6z+m+ukOvZyjuF5bdLMjyTwCtlCOZ1XpD4c+bu/uJsWECKp14hn23QJtGo/KebpY4oUn/qYo1WC+0wVp2AQsDeNcojiTsU9fBADM0SzVp5OR0r2tbBgxXrB2adApj+YpBtaOTDt3E2j32otsYGTF0snf974eLsumZ5TI3aaVKH1NgqhTjRyifmI4h65/h3qVlggNV3ywAzSHtn79FEEXaJDiOFLRSsMTpaUkM5CjiJR5/PxkJ7LxPMECzET+juSosWfrc2Ttivke9HhIi6FJBnNIOnuvUHU/EEWA55vnqlVnZMoCVPPJd0BvbTACXtM="
      + id        = (known after apply)
      + server_id = (known after apply)
      + user_name = "example01-user"
    }

  # module.sftp.aws_transfer_user.transfer_server_write_user_private[0] will be destroyed
  - resource "aws_transfer_user" "transfer_server_write_user_private" {
      - arn                 = "arn:aws:transfer:ap-southeast-1:295611461399:user/s-35e96e08633246ea9/example01-user" -> null
      - home_directory_type = "LOGICAL" -> null
      - id                  = "s-35e96e08633246ea9/example01-user" -> null
      - role                = "arn:aws:iam::295611461399:role/lab-transfer-server-write-role" -> null
      - server_id           = "s-35e96e08633246ea9" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
      - user_name           = "example01-user" -> null

      - home_directory_mappings {
          - entry  = "/" -> null
          - target = "/lab-transfer-server-s3-bucket-c99df09f7019b01c/example1-home" -> null
        }
    }

  # module.sftp.aws_transfer_user.transfer_server_write_user_public[0] will be created
  + resource "aws_transfer_user" "transfer_server_write_user_public" {
      + arn                 = (known after apply)
      + home_directory_type = "LOGICAL"
      + id                  = (known after apply)
      + role                = "arn:aws:iam::295611461399:role/lab-transfer-server-write-role"
      + server_id           = (known after apply)
      + tags_all            = (known after apply)
      + user_name           = "example01-user"

      + home_directory_mappings {
          + entry  = "/"
          + target = "/lab-transfer-server-s3-bucket-c99df09f7019b01c/example1-home"
        }
    }

  # module.vpc.module.vpc.aws_eip.nat[0] will be destroyed
  - resource "aws_eip" "nat" {
      - association_id       = "eipassoc-0539c811d8f98c4eb" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-01efe5ea615845a7c" -> null
      - network_border_group = "ap-southeast-1" -> null
      - network_interface    = "eni-0ea935ce053ff6016" -> null
      - private_dns          = "ip-10-125-11-122.ap-southeast-1.compute.internal" -> null
      - private_ip           = "10.125.11.122" -> null
      - public_dns           = "ec2-54-251-145-17.ap-southeast-1.compute.amazonaws.com" -> null
      - public_ip            = "54.251.145.17" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be destroyed
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:ap-southeast-1:295611461399:internet-gateway/igw-0e370c3e394c1edbc" -> null
      - id       = "igw-0e370c3e394c1edbc" -> null
      - owner_id = "295611461399" -> null
      - tags     = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc"
          - "Terraform"   = "true"
        } -> null
      - tags_all = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc"
          - "Terraform"   = "true"
        } -> null
      - vpc_id   = "vpc-0c1a6f35b4cd9e791" -> null
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be destroyed
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-01efe5ea615845a7c" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-01b5e8fa2ed65a1e5" -> null
      - network_interface_id = "eni-0ea935ce053ff6016" -> null
      - private_ip           = "10.125.11.122" -> null
      - public_ip            = "54.251.145.17" -> null
      - subnet_id            = "subnet-07708c2ad5cc02ee0" -> null
      - tags                 = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] will be destroyed
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0bc63e348ba1dc4291080289494" -> null
      - nat_gateway_id         = "nat-01b5e8fa2ed65a1e5" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0bc63e348ba1dc429" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be destroyed
  - resource "aws_route" "public_internet_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-0e370c3e394c1edbc" -> null
      - id                     = "r-rtb-0e8c9d3bfec4567501080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0e8c9d3bfec456750" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be destroyed
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:ap-southeast-1:295611461399:route-table/rtb-0bc63e348ba1dc429" -> null
      - id               = "rtb-0bc63e348ba1dc429" -> null
      - owner_id         = "295611461399" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-01b5e8fa2ed65a1e5"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.249.0.0/16"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0951610e2a540f8ec"
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.25.0.0/16"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0951610e2a540f8ec"
            },
        ] -> null
      - tags             = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-private-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-private-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0c1a6f35b4cd9e791" -> null
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be destroyed
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:ap-southeast-1:295611461399:route-table/rtb-0e8c9d3bfec456750" -> null
      - id               = "rtb-0e8c9d3bfec456750" -> null
      - owner_id         = "295611461399" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0e370c3e394c1edbc"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-public"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-public"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0c1a6f35b4cd9e791" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be destroyed
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0332e0f9fd0ecf178" -> null
      - route_table_id = "rtb-0bc63e348ba1dc429" -> null
      - subnet_id      = "subnet-06070bdc58cc8225f" -> null
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be destroyed
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0cf4f40431f5540fd" -> null
      - route_table_id = "rtb-0e8c9d3bfec456750" -> null
      - subnet_id      = "subnet-07708c2ad5cc02ee0" -> null
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be destroyed
  - resource "aws_subnet" "private" {
      - arn                             = "arn:aws:ec2:ap-southeast-1:295611461399:subnet/subnet-06070bdc58cc8225f" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "ap-southeast-1a" -> null
      - availability_zone_id            = "apse1-az2" -> null
      - cidr_block                      = "10.125.32.0/19" -> null
      - id                              = "subnet-06070bdc58cc8225f" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "295611461399" -> null
      - tags                            = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-private-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all                        = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-private-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                          = "vpc-0c1a6f35b4cd9e791" -> null
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be destroyed
  - resource "aws_subnet" "public" {
      - arn                             = "arn:aws:ec2:ap-southeast-1:295611461399:subnet/subnet-07708c2ad5cc02ee0" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "ap-southeast-1a" -> null
      - availability_zone_id            = "apse1-az2" -> null
      - cidr_block                      = "10.125.0.0/19" -> null
      - id                              = "subnet-07708c2ad5cc02ee0" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = true -> null
      - owner_id                        = "295611461399" -> null
      - tags                            = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-public-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all                        = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc-public-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                          = "vpc-0c1a6f35b4cd9e791" -> null
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be destroyed
  - resource "aws_vpc" "this" {
      - arn                              = "arn:aws:ec2:ap-southeast-1:295611461399:vpc/vpc-0c1a6f35b4cd9e791" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.125.0.0/16" -> null
      - default_network_acl_id           = "acl-0dff11adcf7fd791d" -> null
      - default_route_table_id           = "rtb-09bdfd931b13493b7" -> null
      - default_security_group_id        = "sg-0e7bf82d94ee2d485" -> null
      - dhcp_options_id                  = "dopt-0fe0e185ed290593e" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0c1a6f35b4cd9e791" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-09bdfd931b13493b7" -> null
      - owner_id                         = "295611461399" -> null
      - tags                             = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc"
          - "Terraform"   = "true"
        } -> null
      - tags_all                         = {
          - "Environment" = "sftp-vpc"
          - "Name"        = "sftp-vpc"
          - "Terraform"   = "true"
        } -> null
    }

Plan: 3 to add, 0 to change, 15 to destroy.

Changes to Outputs:
  ~ transfer_server_arn      = "arn:aws:transfer:ap-southeast-1:295611461399:server/s-35e96e08633246ea9" -> (known after apply)
  ~ transfer_server_endpoint = "s-35e96e08633246ea9.server.transfer.ap-southeast-1.amazonaws.com" -> (known after apply)
  ~ transfer_server_id       = "s-35e96e08633246ea9" -> (known after apply)
```

</details>

*Pusher: @pgcloud, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*